In [ ]:
import pandas as pd
import numpy as np

Q1. Write a Pandas program to set t_id column as an Index in a given dataframe.

In [ ]:
df1 = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})
df1

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

Q2. Write a Pandas program to create a multi Index dataframe using two columns t_id, school_code.

 Q3. Write a Pandas program to 

  a. set a column 't_id' as an Index in a given dataframe without dropping from column

   b. reset the index 't_id' to integer index without adding 't_id' as a repeated column.

Q4. Write a Pandas program to create an index labels index=[1, 2, 3, 4, 5, 6] by 

  a. using 64-bit integers, 
  
  b. using floating-point numbers in a above dataframe.

Q5. Write a Pandas program to create a DataFrame using intervals as an index.

IntervalIndex represents an Index of Interval objects that are all closed on the same side.

pandas.IntervalIndex.from_breaks: Construct an IntervalIndex from an array of splits

pandas.IntervalIndex.from_tuples: Construct an IntervalIndex from a list/array of tuples

pandas.IntervalIndex.from_arrays: Construct from two arrays defining the left and right bounds.

    Output:
                X
    (0.0, 0.5]  1
    (0.5, 1.0]  2
    (1.0, 1.5]  3
    (1.5, 2.0]  4
    (2.0, 2.5]  5
    (2.5, 3.0]  6
    (3.0, 3.5]  7

In [ ]:
x=[1, 2, 3, 4, 5, 6, 7] # as column

# Create an Interval Index using IntervalIndex.from_breaks:
l=[0, 0.5, 1.0, 1.5, 2.0, 2.5, 3, 3.5] # list to make a intervelindex

# Create an Interval Index using IntervalIndex.from_tuples:
t=[(0, .5), (.5, 1), (1, 1.5), (1.5, 2), (2, 2.5), (2.5, 3), (3, 3.5)] # Tupples to make a intervelindex

# Create an Interval Index using IntervalIndex.from_arrays:
a, b = np.array([0, .5, 1, 1.5, 2, 2.5, 3]), np.array([.5, 1, 1.5, 2, 2.5, 3, 3.5]) # array to make a intervelindex

Q6. Write a Pandas program to create a dataframe with sale_amt as column and a datetime index of ten values by .

In [ ]:
Sale_amt=[100, 110, 117, 150, 112, 99, 129, 135, 140, 150]

Q7. Write a Pandas program to set a name of index to Index_name in the above df

Q8. Write a Pandas program to set value in a specific cell in a given dataframe using index.

Replace the values of school_code and date_of_birth in t6 row to s005 and 16/05/2002 in the above dataframe

In [5]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
df

   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s004    VI    David Parkes    15/09/1997      32

Q9. Write a Pandas program to convert index of a above dataframe into a column.

Q10. Write a Pandas program 

a. to set a multilevel index of t_id, school_code, class to the given dataframe and then

b. convert 1st and 3rd levels in the index into columns from a multiple level of index frame.

In [ ]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})
df

  school_code class            name date_of_birth  weight t_id
0        s001     V  Alberto Franco    15/05/2002      35   t1
1        s002     V    Gino Mcneill    17/05/2002      32   t2
2        s003    VI     Ryan Parkes    16/02/1999      33   t3
3        s001    VI    Eesha Hinton    25/09/1998      30   t4
4        s002     V    Gino Mcneill    11/05/2002      31   t5
5        s004    VI    David Parkes    15/09/1997      32   t6

Q11.1 Write a Pandas program to check if a specified value t1, t11 exists in single column index dataframe.

In [ ]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  ['t1', 't2', 't3', 't4', 't5', 't6'])
df

   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s004    VI    David Parkes    15/09/1997      32

Q11.2 Write a Pandas program to check if a specified value t4 exists in multiple column index dataframe.

In [ ]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})
df1 = df.set_index(['t_id', 'school_code', 'class'])
df1

                                  name date_of_birth  weight
t_id school_code class
t1   s001        V      Alberto Franco    15/05/2002      35
t2   s002        V        Gino Mcneill    17/05/2002      32
t3   s003        VI        Ryan Parkes    16/02/1999      33
t4   s001        VI       Eesha Hinton    25/09/1998      30
t5   s002        V        Gino Mcneill    11/05/2002      31
t6   s004        VI       David Parkes    15/09/1997      32

Q12. Write a Pandas program to construct a series of 8 values using random numpy array and set MultiIndex levels as the column and index using sales_arrays.

Sample Output:

    sale   city 
    sale1  city1   -1.533805
          city2   -1.546815
    sale2  city1    0.018307
          city2   -0.210834
    sale3  city1    0.903430
          city2    1.269479
    sale4  city1   -0.550486
          city2    1.738659

In [ ]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]

Q13. Write a Pandas program to construct a DataFrame using random numpy array and set MultiIndex levels as the column and index.

Sample Output:

                        0         1         2         3         4
    sale  city                                                   
    sale1 city1 -1.020550 -0.809408  0.911425  0.059023  0.495317
          city2 -1.208514  0.039022  0.088428 -0.899280  1.722276
    sale2 city1  0.510427 -0.396097 -2.076445  1.080586  1.268495
          city2 -1.158077 -0.892657  1.221519 -0.802645  0.095342
    sale3 city1  1.535934  0.432627 -1.307655  0.031096 -0.060850
          city2  0.601156  0.202661 -1.469705 -1.787885  1.285210
    sale4 city1  0.455104  0.395752  0.115163  1.188649  0.415450
          city2  0.218054 -0.722397  0.590288 -1.347249 -0.223215

In [ ]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]

Q14. Write a Pandas program to extract 

  a. a single row of index (1,2), 

  b. rows in sale1 index

  c. a specific value from a MultiIndex levels where row is ('sale1', 'city2') and column is 1 from above DataFrame.

Q15. Write a Pandas program to 

  a. rename names of columns to col1 to col5 and 
  
  b. specific labels of the row Index from [sale2, city2] to [S2, C2"] in the above dataframe

Q16. Write a Pandas program 

  a. to sort a MultiIndex of a DataFrame. 
  
  b. to sort on level-0 of index in the above dataframe.

Q17. Write a Pandas program 

  a. to extract elements in the given positional row indices. 
  positions = [1, 2, 4]

  b. to extract elements in the given positional column indices of above dataframe.

  c. extract elements in the given positional column indices [1, 2, 4] and reverse the order of the columns to [4,2,1]

Q18. Write a Pandas program to get the index of an element 11 of a given Series.

In [ ]:
ds = pd.Series([1,3,5,7,9,11,13,15], index=[0,1,2,3,4,5,7,8])
ds

0     1
1     3
2     5
3     7
4     9
5    11
7    13
8    15
dtype: int64

Q19.1 Write a Pandas program to select a specific row 3rd row of above series by integer index.

Q19.2 Write a Pandas program to select a specific row 3rd row of above dataframe by integer index.

In [ ]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]})
df

  school_code class            name date_of_birth  weight
0        s001     V  Alberto Franco    15/05/2002      35
1        s002     V    Gino Mcneill    17/05/2002      32
2        s003    VI     Ryan Parkes    16/02/1999      33
3        s001    VI    Eesha Hinton    25/09/1998      30
4        s002     V    Gino Mcneill    11/05/2002      31
5        s004    VI    David Parkes    15/09/1997      32

Q20. Write a Pandas program to find the indexes of rows of a specified value(school_code=s001) of a given column in a DataFrame.

In [ ]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  [1, 2, 3, 4, 5, 6])
df

  school_code class            name date_of_birth  weight
1        s001     V  Alberto Franco    15/05/2002      35
2        s002     V    Gino Mcneill    17/05/2002      32
3        s003    VI     Ryan Parkes    16/02/1999      33
4        s001    VI    Eesha Hinton    25/09/1998      30
5        s002     V    Gino Mcneill    11/05/2002      31
6        s004    VI    David Parkes    15/09/1997      32

Q21. Write a Pandas program 

  a. to drop a index level 0 from a multi-level column index of a dataframe.
  
  b. to drop a index level 1 from a multi-level column index of a dataframe.

Note: Levels are 0-indexed beginning from the top.

In [ ]:
cols = pd.MultiIndex.from_tuples([("a", "x"), ("a", "y"), ("a", "z")])
df = pd.DataFrame([[1,2,3], [3,4,5], [5,6,7]], columns=cols)
df

   a
   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

Q22. Write a Pandas program to insert a column at a specific index 3 in a given DataFrame.

In [ ]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  [1, 2, 3, 4, 5, 6])
df

  school_code class            name  weight
1        s001     V  Alberto Franco      35
2        s002     V    Gino Mcneill      32
3        s003    VI     Ryan Parkes      33
4        s001    VI    Eesha Hinton      30
5        s002     V    Gino Mcneill      31
6        s004    VI    David Parkes      32

In [ ]:
# new column
date_of_birth = ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997']

Q23. Write a Pandas program to print above DataFrame without index.

Q24. Write a Pandas program to find integer index of rows with missing data in weight column of a given dataframe.

In [ ]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])

Q25. Write a Pandas program to start index with different value rather than 0 in a above DataFrame.

Q26. Write a Pandas program to select rows by filtering the value t2 in index tcode of multi-index dataframe.

In [ ]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 37, 33, 30, 31, 32],
    'tcode': ['t1', 't2', 't3', 't4', 't5', 't6']})  
df = df.set_index(['tcode', 'school_code'])
df

                  class            name date_of_birth  weight
tcode school_code
t1    s001            V  Alberto Franco    15/05/2002      35
t2    s002            V    Gino Mcneill    17/05/2002      37
t3    s003           VI     Ryan Parkes    16/02/1999      33
t4    s001           VI    Eesha Hinton    25/09/1998      30
t5    s002            V    Gino Mcneill    11/05/2002      31
t6    s004           VI    David Parkes    15/09/1997      32